In [2]:
import pandas as pd

data = {
    "Region": ["North", "North", "South", "South", "East", "East", "North"],
    "Product": ["Apple", "Banana", "Apple", "Banana", "Apple", "Banana", "Apple"],
    "Sales": [100, 150, 200, 50, 120, 90, 80],
    "Profit": [30, 40, 60, 10, 40, 25, 20]
}

df = pd.DataFrame(data)
df

  Region Product  Sales  Profit
0  North   Apple    100      30
1  North  Banana    150      40
2  South   Apple    200      60
3  South  Banana     50      10
4   East   Apple    120      40
5   East  Banana     90      25
6  North   Apple     80      20

In [5]:
region_sales = df.groupby("Region")["Sales"].sum()
region_sales

Region
East     210
North    330
South    250
Name: Sales, dtype: int64

In [7]:
average_region_sales = df.groupby("Region")["rofit"].mean()
average_region_sales

Region
East     32.5
North    30.0
South    35.0
Name: Profit, dtype: float64

In [9]:
breakdown = df.groupby(["Region", "Product"])["Sales"].sum()
breakdown

Region  Product
East    Apple      120
        Banana      90
North   Apple      180
        Banana     150
South   Apple      200
        Banana      50
Name: Sales, dtype: int64